**QPPSF-8184**

`Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_caller_identity.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.ecs-task-monitor will be created
  + resource "aws_cloudwatch_event_rule" "ecs-task-monitor" {
      + arn            = (known after apply)
      + description    = "This Event bridge rule Monitors ECS clusters of prod and impl and triggers upon a Task State Change"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + clusterArn = [
                      + "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-prod",
                      + "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-impl",
                    ]
                }
              + detail-type = [
                  + "ECS Task State Change",
                ]
              + source      = [
                  + "aws.ecs",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "ecsct-task-monitor-qppsf-dev"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.ecsevent-invoke-lambda will be created
  + resource "aws_cloudwatch_event_target" "ecsevent-invoke-lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "ecsct-task-monitor-qppsf-dev"
      + target_id      = "ecs-task-event-lambda"
    }

  # aws_iam_policy.lambda_cloudwatch_logging will be created
  + resource "aws_iam_policy" "lambda_cloudwatch_logging" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs_lambda_cloudwatch_policy"
      + path      = "/delegatedadmin/developer/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.lambda_publish_to_ses will be created
  + resource "aws_iam_policy" "lambda_publish_to_ses" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs_lambda_ses_policy"
      + path      = "/delegatedadmin/developer/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.lambda_executionrole will be created
  + resource "aws_iam_role" "lambda_executionrole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecsct_lambda_executionrole--qppsf-dev"
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cloudwatchlogs-lambda will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatchlogs-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecsct_lambda_executionrole--qppsf-dev"
    }

  # aws_iam_role_policy_attachment.ses-lambda will be created
  + resource "aws_iam_role_policy_attachment" "ses-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecsct_lambda_executionrole--qppsf-dev"
    }

  # aws_lambda_function.ecs-pagerduty-alerts will be created
  + resource "aws_lambda_function" "ecs-pagerduty-alerts" {
      + arn                            = (known after apply)
      + filename                       = "ecs-pgduty-alerts.zip"
      + function_name                  = "ecs-pgduty-alerts"
      + handler                        = "ecs-pgduty-alerts.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ecs-pgduty-alerts"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------`